In [1]:
import numpy as np, pandas as pd

In [2]:
df = pd.read_csv("StudentMark.csv")

In [3]:
df.head()

  Gender  Attendent  Lecture  Lab Grade  Unnamed: 5  Unnamed: 6  Unnamed: 7
0    ພຣະ         10     29.0   24     C         NaN         NaN         NaN
1    ນາງ          2      0.0    0     F         NaN         NaN         NaN
2    ນາງ         10     31.0   27    C+         NaN         NaN         NaN
3    ນາງ         10     49.0   38     A         NaN         NaN         NaN
4    ນາງ         10     31.0   29     B         NaN         NaN         NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Gender      34 non-null     object
 1   Attendent   34 non-null     int64
 2   Lecture     33 non-null     float64
 3   Lab         34 non-null     int64
 4   Grade       34 non-null     object
 5   Unnamed: 5  0 non-null      float64
 6   Unnamed: 6  0 non-null      float64
 7   Unnamed: 7  0 non-null      float64
dtypes: float64(4), int64(2), object(2)
memory usage: 2.2+ KB

In [5]:
#check how many nulls are there in each feature
for col in df.columns:
    print(f"{col} : {df[col].isnull().sum()}")

Gender : 0
Attendent : 0
Lecture : 1
Lab : 0
Grade : 0
Unnamed: 5 : 34
Unnamed: 6 : 34
Unnamed: 7 : 34

In [6]:
#select only features containing at least one non-null
df = df.loc[:, df.notnull().any()]

In [7]:
df.head()

  Gender  Attendent  Lecture  Lab Grade
0    ພຣະ         10     29.0   24     C
1    ນາງ          2      0.0    0     F
2    ນາງ         10     31.0   27    C+
3    ນາງ         10     49.0   38     A
4    ນາງ         10     31.0   29     B

In [8]:
# convert "ທ້າວ", "ພຣະ" and "ນາງ" into "M", "M" and "F", respectively.
df["Gender"] = df["Gender"].map({"ພຣະ":"M", "ທ້າວ":"M", "ນາງ":"F"})

In [9]:
df.head()

  Gender  Attendent  Lecture  Lab Grade
0      M         10     29.0   24     C
1      F          2      0.0    0     F
2      F         10     31.0   27    C+
3      F         10     49.0   38     A
4      F         10     31.0   29     B

In [10]:
# find a column containing at least one null
df.loc[:, df.isnull().any()].columns

Index(['Lecture'], dtype='object')

In [11]:
# replace null with mean
df.replace(np.nan, 0, inplace=True)

In [12]:
df.isnull().sum()

Gender       0
Attendent    0
Lecture      0
Lab          0
Grade        0
dtype: int64

In [13]:
# create a new column, "Total", that sums lecture, lab and grade columns up
df["Total"] = df[["Attendent", "Lecture", "Lab"]].sum(axis=1)
df.head()

  Gender  Attendent  Lecture  Lab Grade  Total
0      M         10     29.0   24     C   63.0
1      F          2      0.0    0     F    2.0
2      F         10     31.0   27    C+   68.0
3      F         10     49.0   38     A   97.0
4      F         10     31.0   29     B   70.0

In [14]:
# drop 'grade' column
df.drop(columns=["Grade"], inplace=True)

In [15]:
# add a new column, "grade", that describes the Total column
df["Comment"] = np.where(df["Total"] > 90, "Excellent", 
                      np.where(df.Total > 70, "Better",
                              np.where(df.Total > 50, "Good", "Fail"
                                      )
                              )
                      )

In [16]:
df.head()

  Gender  Attendent  Lecture  Lab  Total    Comment
0      M         10     29.0   24   63.0       Good
1      F          2      0.0    0    2.0       Fail
2      F         10     31.0   27   68.0       Good
3      F         10     49.0   38   97.0  Excellent
4      F         10     31.0   29   70.0       Good

In [17]:
df.to_csv("final_student_mark.csv")